{
  "preRequisites:11": [],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "     If you are someone who is familiar with some or most of the mods in this pack, this pack changes and/or tweaks a lot of such base features. There will be things you would normally expect to work one way that work completely differently here. To help with potential confusion regarding that, here are some of the more important changes you should know about:\n\n\n§a- The simple powered furnace is the first actual furnace that is obtainable\n\n- PSI power does not fill up naturally. You need a cell from PSIO or you can pick up XP orbs. Empty cells can be recharged through PSIO.\n\n- Ore excavation is enabled, but it required both XP and hunger to use\n\n- The Last Stand enchantment has a cooldown based on the combined level of your armor\n\n- Most Tinker\u0027s materials have skill level requirements, but vanilla tools/armor do not\n\n- Pistons are not craftable in the Twilight Forest\n\n- Ores will not always drop when you mine them. This typically means you do not have the required stage for the ore and it will be obtainable later on\n\n- Most of the progressional stages are granted from storyline advancements\n\n- Attacks will not work if they are less than 75% charged. If you try spamming attacks using a slow weapon it will not work. This can be bypassed with the No Cooldowns skill trait",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "extendedcrafting:singularity_ultimate"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Dimension Hopper 101",
      "questlogic:8": "AND",
      "repeat_relative:1": 0,
      "repeattime:3": 10,
      "simultaneous:1": 0,
      "snd_complete:8": "contenttweaker:questcommon",
      "snd_update:8": "contenttweaker:questcommon",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}